#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.juju_offer.ingress: Reading...
data.juju_offer.ca_certificate: Reading...
data.juju_offer.openfga: Reading...
data.juju_offer.database: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # juju_application.admin_ui will be created
  + resource "juju_application" "admin_ui" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "admin-ui"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "identity-platform-admin-ui"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.hydra will be created
  + resource "juju_application" "hydra" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "hydra"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "hydra"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.kratos will be created
  + resource "juju_application" "kratos" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "kratos"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "kratos"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.login_ui will be created
  + resource "juju_application" "login_ui" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "login-ui"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "identity-platform-login-ui-operator"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_integration.hydra_admin_ui_info will be created
  + resource "juju_integration" "hydra_admin_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
    }

  # juju_integration.hydra_admin_ui_oauth will be created
  + resource "juju_integration" "hydra_admin_ui_oauth" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "oauth"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "oauth"
          + name     = "hydra"
        }
    }

  # juju_integration.hydra_login_ui_ui_info will be created
  + resource "juju_integration" "hydra_login_ui_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "login-ui"
        }
    }

  # juju_integration.kratos_admin_ui_info will be created
  + resource "juju_integration" "kratos_admin_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "kratos-info"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "kratos-info"
          + name     = "kratos"
        }
    }

  # juju_integration.kratos_external_idp will be created
  + resource "juju_integration" "kratos_external_idp" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "kratos-external-idp"
          + name     = "kratos"
        }
      + application {
          + endpoint = "kratos-external-idp"
          + name     = "kratos-external-idp-integrator"
        }
    }

  # juju_integration.kratos_hydra_info will be created
  + resource "juju_integration" "kratos_hydra_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "kratos"
        }
    }

  # juju_integration.kratos_login_ui_info will be created
  + resource "juju_integration" "kratos_login_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "kratos-info"
          + name     = "kratos"
        }
      + application {
          + endpoint = "kratos-info"
          + name     = "login-ui"
        }
    }

  # juju_integration.kratos_login_ui_ui_info will be created
  + resource "juju_integration" "kratos_login_ui_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "kratos"
        }
      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "login-ui"
        }
    }

  # juju_integration.login_ui_hydra_info will be created
  + resource "juju_integration" "login_ui_hydra_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "login-ui"
        }
    }

  # juju_offer.kratos_info_offer will be created
  + resource "juju_offer" "kratos_info_offer" {
      + application_name = "kratos"
      + endpoint         = "kratos-info"
      + id               = (known after apply)
      + model            = "identity-platform"
      + name             = "kratos-info-offer"
      + url              = (known after apply)
    }

  # juju_offer.oauth_offer will be created
  + resource "juju_offer" "oauth_offer" {
      + application_name = "hydra"
      + endpoint         = "oauth"
      + id               = (known after apply)
      + model            = "identity-platform"
      + name             = "oauth-offer"
      + url              = (known after apply)
    }

  # module.kratos_external_idp_integrator.juju_application.external_idp_integrator will be created
  + resource "juju_application" "external_idp_integrator" {
      + config      = (sensitive value)
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "kratos-external-idp-integrator"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "kratos-external-idp-integrator"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kratos_info_offer_url = (known after apply)
  + oauth_offer_url       = (known after apply)

```

</details>

*Pusher: @shipperizer, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*